/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

#include  "config.h"
#include	"Task.h"
#include	"System_init.h"\
#include	"STC32G_GPIO.h"
#include	"STC32G_NVIC.h"
#include	"STC32G_I2C.h"

//========================================================================
// Define: init gpio
// Desc: 
// Data: 
// Return: 
// Ver: V1.0
//========================================================================
void start_gpio(void)
{
	P0_MODE_IO_PU(GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2);
	P1_MODE_IO_PU(GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2);
	
}
//========================================================================
// Define: start i2c master
// Desc: 
// Data: 
// Return: 
// Ver: V1.0
//========================================================================
void start_i2c(void)
{
	I2C_InitTypeDef I2C_InitStruct;
	I2C_InitStruct.I2C_Enable = ENABLE;
	I2C_InitStruct.I2C_Mode = I2C_Mode_Master;
	I2C_InitStruct.I2C_MS_WDTA = DISABLE;
	I2C_Init(&I2C_InitStruct);
	NVIC_I2C_Init(I2C_Mode_Master, ENABLE, Priority_0);
}

//========================================================================
// 函数: void	main(void)
// 描述: 主函数程序.
// 参数: None.
// 返回: None.
// 版本: V1.0, 2012-10-22
//========================================================================
void main(void)
{
	WTST = 0;		//设置程序指令延时参数，赋值为0可将CPU执行指令的速度设置为最快
	EAXSFR();		//扩展SFR(XFR)访问使能 
	CKCON = 0;      //提高访问XRAM速度

	SYS_Init();
	
	start_i2c();
	EA = 1;
	
}
